config.org
#+title: Diamong Config
#+author: Jacopo Costantini


* General Settings

#+begin_src elisp :tangle ~/.emacs.d/init.el
  ;; init.el --- Load the full configuration -*- lexical-binding: t -*-

  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))

  (setq custom-file (locate-user-emacs-file "custom.el"))
  (when (file-exists-p custom-file)
    (load custom-file))

  (setq use-file-dialog nil)
  (setq use-dialog-box nil)
  (setq inhibit-startup-screen t)

  (setq-default
   window-resize-pixelwise t
   frame-resize-pixelwise t)

  (let ((no-border '(internal-border-width . 0)))
    (add-to-list 'default-frame-alist no-border)
    (add-to-list 'initial-frame-alist no-border))

  (setq frame-title-format
        '((:eval (if (buffer-file-name)
                     (abbreviate-file-name (buffer-file-name))
                   "%b"))))

  (setq initial-major-mode 'text-mode)
#+end_src

** GC Optimizations

#+begin_src elisp :tangle ~/.emacs.d/early-init.el
  ;; -*- lexical-binding: t; -*
  (defconst *is-a-mac* (eq system-type 'darwin))
  (setq package-enable-at-startup nil)

          ;;; Runtime optimizations
  ;; PERF: A second, case-insensitive pass over `auto-mode-alist' is time wasted.
  (setq auto-mode-case-fold nil)

  ;; PERF: Disable bidirectional text scanning for a modest performance boost.
  ;;   I've set this to `nil' in the past, but the `bidi-display-reordering's docs
  ;;   say that is an undefined state and suggest this to be just as good:
  (setq-default bidi-display-reordering 'left-to-right
                bidi-paragraph-direction 'left-to-right)

  ;; PERF: Disabling BPA makes redisplay faster, but might produce incorrect
  ;;   reordering of bidirectional text with embedded parentheses (and other
  ;;   bracket characters whose 'paired-bracket' Unicode property is non-nil).
  (setq bidi-inhibit-bpa t)  ; Emacs 27+ only

  ;; Reduce rendering/line scan work for Emacs by not rendering cursors or regions
  ;; in non-focused windows.
  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)

  ;; More performant rapid scrolling over unfontified regions. May cause brief
  ;; spells of inaccurate syntax highlighting right after scrolling, which should
  ;; quickly self-correct.
  ;; (setq fast-but-imprecise-scrolling t)

  ;; Don't ping things that look like domain names.
  (setq ffap-machine-p-known 'reject)

  ;; Emacs "updates" its ui more often than it needs to, so slow it down slightly
  (setq idle-update-delay 1.0)  ; default is 0.5

  ;; Font compacting can be terribly expensive, especially for rendering icon
  ;; fonts on Windows. Whether disabling it has a notable affect on Linux and Mac
  ;; hasn't been determined, but do it anyway, just in case. This increases memory
  ;; usage, however!
  (setq inhibit-compacting-font-caches t)

  ;; Increase how much is read from processes in a single chunk (default is 4kb).
  ;; This is further increased elsewhere, where needed (like our LSP module).
  (setq read-process-output-max (* 3 1024 1024)) ; 3 MiB


  ;; Introduced in Emacs HEAD (b2f8c9f), this inhibits fontification while
  ;; receiving input, which should help a little with scrolling performance.
  (setq redisplay-skip-fontification-on-input t)

          ;;; Disable UI elements early
  ;; PERF,UI: Doom strives to be keyboard-centric, so I consider these UI elements
  ;;   clutter. Initializing them also costs a morsel of startup time. Whats more,
  ;;   the menu bar exposes functionality that Doom doesn't endorse. Perhaps one
  ;;   day Doom will support these, but today is not that day.
  ;;
  ;; HACK: I intentionally avoid calling `menu-bar-mode', `tool-bar-mode', and
  ;;   `scroll-bar-mode' because they do extra work to manipulate frame variables
  ;;   that isn't necessary this early in the startup process.
  (push '(menu-bar-lines . 0)   default-frame-alist)
  (push '(tool-bar-lines . 0)   default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)
  ;; And set these to nil so users don't have to toggle the modes twice to
  ;; reactivate them.
  (setq menu-bar-mode nil
        tool-bar-mode nil
        scroll-bar-mode nil)
  ;; FIX: On MacOS, disabling the menu bar makes MacOS treat Emacs as a
  ;;   non-application window -- which means it doesn't automatically capture
  ;;   focus when it is started, among other things, so enable the menu-bar for
  ;;   GUI frames, but keep it disabled in terminal frames because there it
  ;;   activates an ugly, in-frame menu bar.
  (when *is-a-mac*
    (add-hook 'window-setup-hook 'doom-restore-menu-bar-in-gui-frames-h)
    (add-hook 'after-make-frame-functions 'doom-restore-menu-bar-in-gui-frames-h)
    (defun doom-restore-menu-bar-in-gui-frames-h (&optional frame)
      (let ((use-frame (or frame (selected-frame))))
        (when (display-graphic-p use-frame)
          (set-frame-parameter use-frame 'menu-bar-lines 1)))))

      ;;; Encodings
  ;; Contrary to what many Emacs users have in their configs, you don't need more
  ;; than this to make UTF-8 the default coding system:
  (set-language-environment "UTF-8")

  (setq default-input-method nil)

  (setq garbage-collection-messages t)
  (let ((normal-gc-cons-threshold (* 100 1024 1024))  ; Set to 100MB
        (init-gc-cons-threshold (* 128 1024 1024)))   ; Set to 128MB
    (setq gc-cons-threshold init-gc-cons-threshold)
    (add-hook 'emacs-startup-hook
              (lambda () (setq gc-cons-threshold normal-gc-cons-threshold))))
#+end_src

** Package manager configuration

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-pkgmanager.el
  ;; -*- lexical-binding: t; -*-
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (eval-when-compile
    (require 'use-package)
    (require 'straight)
    (setq straight-use-package-by-default t))

  (use-package diminish)

  (provide 'init-pkgmanager)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-pkgmanager)
#+end_src

** macOS

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-macos.el
  ;; -*- lexical-binding: t; -*-

  (when *is-a-mac*
    (setq mac-command-modifier 'meta)
    (setq mac-option-modifier 'none)

    (use-package exec-path-from-shell
      :config
      (exec-path-from-shell-initialize))

    (use-package osx-trash
      :config
      (setq delete-by-moving-to-trash t)
      (osx-trash-setup))

    (use-package reveal-in-osx-finder
      :bind ("C-c z" . reveal-in-osx-finder)))

  (provide 'init-macos)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (when *is-a-mac*
    (require 'init-macos))
#+end_src

** User local preferences

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-local nil t)
#+end_src

** Appearance

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-theme.el
  ;; -*- lexical-binding: t; -*-

  (setq custom-safe-themes t)

  (use-package autothemer)

  (use-package zenburn-theme)

  (use-package sublime-themes)
  (use-package subatomic-theme)
  (use-package plan9-theme)

  ;; (load-theme 'spolsky t)
  ;; (load-theme 'modus-vivendi t)
  (load-theme 'plan9 t)
  ;; (load-theme 'subatomic t)

  (use-package pulsar
    :config
    (setq pulsar-pulse t
          ;; pulsar-face 'pulsar-yellow
          ;; pulsar-highlight-face 'pulsar-purple
          pulsar-delay 0.055)
    (add-to-list 'pulsar-pulse-functions 'ace-window)
    (pulsar-global-mode 1))

  (use-package display-time
    :straight nil
    :hook after-init
    :init
    (setq display-time-day-and-date t
          display-time-24hr-format  t
          display-time-default-load-average nil))

  (provide 'init-theme)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-theme)
#+end_src

