config.org
** Shell

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-shell.el
  ;; -*- lexical-binding: t; -*-

  (use-package vterm
    :bind ("C-c t V" . vterm))

  (use-package vterm-toggle
    :bind ("C-c t v" . vterm-toggle))

  (use-package eshell
    :straight nil
    :bind ("C-c t E" . eshell))

  (use-package eshell-toggle
    :bind ("C-c t e" . eshell-toggle))

  (use-package eshell-prompt-extras
    :init
    (with-eval-after-load "esh-opt"
      (autoload 'epe-theme-lambda "eshell-prompt-extras")
      (setq eshell-highlight-prompt nil
            eshell-prompt-function 'epe-theme-lambda)))

  (use-package eshell-syntax-highlighting
    :config
    (eshell-syntax-highlighting-global-mode +1))

  (provide 'init-shell)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-shell)
#+end_src

* Packages

** Dired

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-dired.el
  ;; -*- lexical-binding: t; -*-

  (require 'dired)
  (setq-default dired-dwim-target t)

  ;; Prefer g-prefixed coreutils version of standard utilities when available
  (let ((gls (executable-find "gls")))
    (when gls (setq insert-directory-program gls)))

  (use-package diredfl
    :config
    (diredfl-global-mode 1))

  (use-package dired-recent
    :init
    (dired-recent-mode 1))

  (use-package dired-hacks-utils
    :bind (:map dired-mode-map
                ("M-n" . dired-hacks-next-file)
                ("M-p" . dired-hacks-previous-file)))

  (use-package dired-filter
    :bind (:map dired-mode-map
                ("/" . dired-filter-mode)))

  (use-package dired-subtree
    :bind (:map dired-mode-map
                ("i" . dired-subtree-insert)
                (";" . dired-subtree-remove)))

  (use-package dired-narrow
    :bind (:map dired-mode-map
                ("s" . dired-narrow))
    :config
    (setq dired-narrow-exit-when-1-left nil))

  (provide 'init-dired)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-dired)
#+end_src

** Vertico Completion

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-vertico.el
  ;; -*- lexical-binding: t; -*-
  (use-package vertico
    :hook ((after-init . vertico-mode)
           (rfn-eshadow-update-overlay . vertico-directory-tidy)
           (minibuffer-setup . vertico-repeat-save)
           (minibuffer-setup . cursor-intangible-mode))
    :bind (:map vertico-map
                ("DEL" . vertico-directory-delete-char)
                ("?"   . minibuffer-completion-help))
    :init
    (defun crm-indicator (args)
      (cons (format "[CRM%s] %s"
                    (replace-regexp-in-string
                     "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                     crm-separator)
                    (car args))
            (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)
    (setq minibuffer-prompt-properties
          '(read-only t cursor-intangible t face minibuffer-prompt))
    (setq enable-recursive-minibuffers t)
    :config
    (setq vertico-resize nil
          vertico-count 17
          vertico-cycle t)
    (setq-default completion-in-region-function
                  (lambda (&rest args)
                    (apply (if vertico-mode
                               #'consult-completion-in-region
                             #'completion--in-region)
                           args))))
  (use-package orderless
    :init
    ;; Configure a custom style dispatcher (see the Consult wiki)
    ;; (setq orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch)
    ;;       orderless-component-separator #'orderless-escapable-split-on-space)
    (setq completion-styles '(orderless basic)
          completion-category-defaults nil
          completion-category-overrides '((file (styles partial-completion)))))

  (use-package savehist
    :straight nil
    :hook after-init)

  (use-package consult
    :defer t
    :bind
    (([remap bookmark-jump] . consult-bookmark)
     ([remap goto-line] . consult-goto-line)
     ([remap imenu] . consult-imenu)
     ([remap Info-search] . consult-info)
     ([remap locate] . consult-locate)
     ([remap load-theme] . consult-theme)
     ([remap man] . consult-man)
     ([remap recentf-open-files] . consult-recent-file)
     ([remap switch-to-buffer] . consult-buffer)
     ([remap yank-pop] . consult-yank-pop)
     ("C-h D t" . consult-theme)
     ("M-g M-g" . consult-line)
     ("M-g M-m" . consult-line-multi)
     ("C-x M-f" . consult-fd)
     ("C-c ! j" . consult-flymake)
     ("C-c o"   . consult-outline)
     ("C-c M-r" . consult-ripgrep)
     :map org-mode-map
     ("C-c o" . consult-org-heading))
    :config
    (setq consult-line-numbers-widen t
          consult-async-min-input 2
          consult-async-refresh-delay  0.15
          consult-async-input-throttle 0.2
          consult-async-input-debounce 0.1)
    )

  (use-package consult-dir
    :bind (([remap list-directory] . consult-dir)
           :map vertico-map
           ("C-x C-d" . consult-dir)
           ("C-x C-j" . consult-dir-jump-file)))

  (use-package consult-flycheck
    :after (consult flycheck))

  (use-package embark
    :defer t
    :init
    (setq which-key-use-C-h-commands nil
          prefix-help-command #'embark-prefix-help-command)
    :bind (
           ([remap describe-bindings] . embark-bindings)
           ("C-;" . embark-act)
           :map minibuffer-local-map
           ("C-;" . embark-act)
           ("C-c C-;" . embark-export)
           ("C-c C-l" . embark-collect)))

  (use-package embark-consult
    :after (embark consult))

  (use-package marginalia
    :init
    (marginalia-mode)
    :bind (:map minibuffer-local-map
                ("M-A" . marginalia-cycle)))

  (provide 'init-vertico)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-vertico)
#+end_src

** Projectile

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-projectile.el
  ;; -*- lexical-binding: t; -*-

  (use-package projectile
    :defer 5
    :bind (:map projectile-mode-map
                ("C-c p" . projectile-command-map))
    :config
    (setq projectile-indexing-method                'alien
          projectile-sort-order                     'modification-time
          projectile-enable-caching                 t
          projectile-per-project-compilation-buffer t
          projectile-mode-line-function             '(lambda ()
                                                       (format " Proj[%s]"
                                                               (projectile-project-name))))
    (projectile-mode +1))

  (use-package projectile-git-autofetch
    :diminish projectile-git-autofetch-mode
    :config
    (projectile-git-autofetch-mode 1))

  (use-package ibuffer
    :straight nil
    :bind (("C-x C-b" . ibuffer)))

  (use-package ibuffer-projectile)

  (provide 'init-projectile)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-projectile)
#+end_src

** Grep

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-grep.el
  ;; -*- lexical-binding: t; -*-

  (setq-default grep-highlight-matches t
                grep-scroll-output t)

  (when *is-a-mac*
    (setq-default locate-command "mdfind"))

  (use-package ripgrep)

  (use-package wgrep
    :commands wgrep-change-to-wgrep-mode
    :config (setq wgrep-auto-save-buffer t))

  (provide 'init-grep)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-grep)
#+end_src

** Copilot

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-copilot.el
  ;; -*- lexical-binding: t; -*-

  (use-package copilot
    :straight (:host github :repo "zerolfx/copilot.el" :files ("dist" "*.el"))
    :hook prog-mode
    :bind (("C-TAB"    . copilot-accept-completion)
           ("C-<tab>"  . copilot-accept-completion))
    :config
    (setq copilot-idle-delay 1))

  (provide 'init-copilot)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-copilot)
#+end_src


** Corfu

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-corfu.el
  ;; -*- lexical-binding: t; -*-

  (use-package corfu
    :hook
    ((shell-mode  . (lambda () (setq-local corfu-auto nil)))
     (eshell-mode . (lambda () (setq-local corfu-auto nil)))
     (term-mode   . (lambda () (setq-local corfu-auto nil)))
     (after-init  . global-corfu-mode))
    :custom
    (corfu-cycle t)
    (corfu-auto t)
    (corfu-commit-predicate nil)
    (corfu-quit-no-match t)
    (corfu-auto-delay 0)
    (corfu-auto-prefix 1)
    :bind (:map corfu-map
                ("TAB" . corfu-insert)
                ([tab] . corfu-insert))

    (provide 'init-corfu)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  ;;(require 'init-corfu)
#+end_src

** Company

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-company.el
  ;; -*- lexical-binding: t; -*-

  (use-package company
    :hook ((prog-mode . (lambda ()
                          (setq-local company-backends
                                      '((company-capf :with company-yasnippet)))
                          (company-mode)))
           (text-mode . (lambda ()
                          (setq-local company-backends
                                      '((company-dabbrev company-ispell :separate)
                                        company-files))
                          (company-mode))))
    :config
    (setq company-tooltip-align-annotations t
          company-selection-wrap-around t
          company-lighter-base "©"
          company-tooltip-limit 14
          company-idle-delay 0.05 ;; correggimi
          company-minimum-prefix-length 2
          company-require-match 'never
          ;; company-format-margin-function 'company-text-icons-margin
          company-tooltip-minimum 4
          ;; company-text-face-extra-attributes '(:weight bold :slant italic)
          ;; company-text-icons-add-background t
          company-auto-commit nil
          company-dabbrev-other-buffers nil
          company-dabbrev-ignore-case nil
          company-dabbrev-downcase nil
          company-tooltip-flip-when-above t
          company-show-quick-access 'left
          company-backends '(company-capf)
          company-frontends '(company-pseudo-tooltip-frontend
                              company-echo-metadata-frontend)
          company-files-exclusions '(".git/" ".DS_Store")
          company-transformers '(delete-consecutive-dups
                                 company-sort-by-occurrence)
          company-global-modes '(not erc-mode message-mode help-mode eshell-mode))
    :bind (:map company-active-map
                ("<tab>" . company-complete-selection)))

  (use-package company-box
    :hook company-mode
    :config
    (setq company-box-show-single-candidate t
          company-box-backends-colors nil
          company-box-tooltip-limit 50))

  (provide 'init-company)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-company)
#+end_src


** Eglot

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-eglot.el
  ;; -*- lexical-binding: t; -*-

  (require 'eglot)

  (provide 'init-eglot)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  ;;(require 'init-eglot)
#+end_src

