config.org
** LSP Mode

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-lsp.el
  ;; -*- lexical-binding: t; -*-

  (use-package lsp-mode
    :commands lsp
    :hook ((c-ts-mode    . lsp)
           (c++-ts-mode  . lsp)
           (ruby-mode . lsp)
           (lsp-mode  . lsp-enable-which-key-integration))
    :config
    (setq lsp-log-io nil
          lsp-idle-delay 0.1))

  (use-package lsp-java
    :hook ((java-ts-mode . lsp)))

  (use-package lsp-dart
    :hook (dart-mode . lsp)
    :config
    (setq lsp-dart-sdk-dir "/opt/homebrew/Caskroom/flutter/3.13.6/flutter")
    (dap-register-debug-template "Flutter :: Custom debug"
                                 (list :flutterPlatform "arm64"
                                       :program "lib/main.dart"
                                       :args '("--flavor" "customer_a"))))

  (use-package lsp-treemacs
    :after lsp-mode treemacs
    :config
    (lsp-treemacs-sync-mode 1))

  (use-package treemacs
    :defer t
    :bind (([f8] . treemacs)
           ([f9] . treemacs-select-window))
    :config
    (progn
      (setq treemacs-is-never-other-window t)
      (setq treemacs-git-mode 'extended)))

  (use-package treemacs-projectile
    :after treemacs projectile)

  (use-package treemacs-magit
    :after treemacs magit)

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode))

  (provide 'init-lsp)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-lsp)
#+end_src

** Windows

Ace Window Config
Remember:
x - delete window
m - swap windows
M - move window
c - copy window
j - select buffer
n - select the previous window
u - select buffer in the other window
c - split window fairly, either vertically or horizontally
v - split window vertically
b - split window horizontally
o - maximize current window
? - show these command bindings

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-windows.el
  ;; -*- lexical-binding: t; -*-

  (use-package winner-mode
    :straight nil
    :hook after-init)

  (use-package ace-window
    :bind ("M-o" . ace-window)
    :config
    (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))

  (provide 'init-windows)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-windows)
#+end_src

** Git

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-git.el
  ;; -*- lexical-binding: t; -*-

  (use-package git-modes)

  (use-package git-timemachine
    :bind ("C-x v t" . git-timemachine-toggle))

  (use-package magit
    :bind
    (([(meta f12)] . magit-status)
     ("C-x g"      . magit-status)
     ("C-x M-g"    . magit-dispatch))
    :hook (magit-mode . (lambda () (local-unset-key [(meta h)])))
    :config
    (setq-default magit-diff-refine-hunk 'all))

  (use-package forge
    :after magit)

  (use-package diff-hl
    :hook ((dired-mode         . diff-hl-dired-mode)
           (magit-post-refresh . diff-hl-magit-post-refresh)
           (after-init         . global-diff-hl-mode))
    :bind (:map diff-hl-mode-map
                ("<left-fringe> <mouse-1>" . diff-hl-diff-goto-hunk)))

  (provide 'init-git)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-git)
#+end_src

** ORG MODE

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-org.el
  ;; -*- lexical-binding: t; -*-

  (use-package org
    :config
    (setq org-latex-src-block-backend 'minted)

    (add-to-list 'org-latex-packages-alist '("" "minted"))

    (setq org-latex-pdf-process
          '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
            "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
            "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f")))

  (use-package org-wc
    :after org)

  (use-package olivetti)

  (use-package org-pomodoro
    :after org)

  (use-package org-zettelkasten
    :hook org-mode)

  (use-package org-super-agenda
    :after org-agenda
    :config
    (setq org-agenda-files '("~/org/agenda/agenda.org"
                             "~/org/agenda/sessione.org"))
    (setq org-super-agenda-groups
          '((:name "Oggi"
                   :time-grid t
                   :scheduled today)
            (:name "Importante"
                   :priority "A")))
    (org-super-agenda-mode))

  (provide 'init-org)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-org)
#+end_src

** Docker

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-docker.el
  ;; -*- lexical-binding: t; -*-

  (use-package docker)

  (use-package docker-compose-mode)

  (use-package dockerfile-mode
    :config
    (put 'dockerfile-image-name 'safe-local-variable #'stringp))

  (provide 'init-docker)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-docker)
#+end_src

** Yasnippet

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-yasnippet.el
  ;; -*- lexical-binding: t; -*-

  (use-package yasnippet
    :defer 5
    :diminish yasnippet
    :bind (:map  yas-minor-mode-map
                 ("<backtab>" . yas-expand))
    :config
    ;;(setq yas-snippet-dirs '("~/.emacs.d/personal-snippets"))
    (yas-global-mode 1))

  (use-package yasnippet-snippets
    :after yasnippet)

  (provide 'init-yasnippet)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-yasnippet)
#+end_src

* Languages

** Dart

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-dart.el
  ;; -*- lexical-binding: t; -*-

  (use-package dart-mode
    :bind (:map dart-mode-map
                ("C-M-x" . flutter-run-or-hot-reload)))

  (use-package flutter
    :config
    (setq flutter-sdk-path "/opt/homebrew/Caskroom/flutter/3.13.6/flutter/"))

  (provide 'init-dart)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-dart)
#+end_src

** C/C++

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-cxx.el
  ;; -*- lexical-binding: t; -*-

  (setq c-ts-mode-indent-offset 4)

  (use-package modern-cpp-font-lock
    :hook (c++-mode . modern-c++-font-lock-mode))

  (use-package disaster)

  (use-package cmake-mode)

  (use-package flycheck-clang-analyzer
    :hook (c++-ts-mode . (lambda () (setq flycheck-clang-language-standard "c++17")))
    :config (flycheck-clang-analyzer-setup))

  (provide 'init-cxx)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-cxx)
#+end_src

** Java

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-java.el
  ;; -*- lexical-binding: t; -*-

  (setq java-ts-mode-indent-offset 8)

  (provide 'init-java)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-java)
#+end_src

** Go

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-go.el
  ;; -*- lexical-binding: t; -*-

  (use-package go-mode
    :mode ("\\.go\\'" . go-mode))

  (provide 'init-go)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-go)
#+end_src

** Ruby

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-ruby.el
  ;; -*- lexical-binding: t; -*-

  (use-package rbenv
    :config
    (setq rbenv-executable "/opt/homebrew/bin/rbenv"
          rbenv-binary-paths '((shims-path . "~/.rbenv/shims")
                               (bin-path . "/opt/homebrew/bin/rbenv")))
    (global-rbenv-mode))

  ;; (use-package rvm
  ;;   :config
  ;;   (rvm-use-default))

  (use-package inf-ruby
    :hook (ruby-mode . inf-ruby-minor-mode))

  (use-package robe
    :hook ruby-mode
    :config
    (eval-after-load 'company
      '(push 'company-robe company-backends)))

  (use-package bundler
    :after ruby-mode)

  (use-package rspec-mode
    :hook ruby-mode
    :config
    (setq rspec-use-rake-when-possible nil))

  (use-package yari
    :bind (:map ruby-mode-map
                ("C-c k" . yari))
    :after ruby-mode)

  (provide 'init-ruby)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-ruby)
#+end_src

** Common lisp

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-clisp.el
  ;; -*- lexical-binding: t; -*-

  (use-package slime
    :config
    (setq inferior-lisp-program "/opt/homebrew/bin/sbcl"))

  (provide 'init-clisp)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-clisp)
#+end_src

* Custom

** Autotangle

#+begin_src elisp :tangle ~/.emacs.d/lisp/auto-tangle.el
  ;; -*- lexical-binding: t; -*-

  (require 'ob-tangle)

  (defun tangle-config ()
    "Automatically tangle `config.org`, delete old .elc files, and byte-compile."
    (when (string= (buffer-file-name)
		   (expand-file-name (concat user-emacs-directory
					     "config.org")))
      (org-babel-tangle)
      ;; (let ((tangled-files (org-babel-tangle)))
      ;;   (dolist (file tangled-files)
      ;;     (let ((elc-file (concat file "c")))
      ;;       (when (file-exists-p elc-file)
      ;;         (delete-file elc-file))
      ;;       ;; Do not byte-compile init.el and early-init.el
      ;;       (unless (or (string= (file-name-nondirectory file) "init.el")
      ;;                   (string= (file-name-nondirectory file) "early-init.el"))

      ;;         (byte-compile-file file)))))
      ))

  (add-hook 'org-mode-hook (lambda ()
			     (add-hook 'after-save-hook #'tangle-config)))

  (provide 'auto-tangle)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'auto-tangle)
#+end_src
